20210218090450-org_tufte_export.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
  <!-- 2021-02-19 Fri 10:59 -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=utf-8" />
  <meta name="viewport" content=
  "width=device-width, initial-scale=1" />
  <title>org tufte export</title>
  <meta name="generator" content="Org mode" />
  <meta name="author" content="ii friend" />
</head>
<body>
  <div id="content">
    <h1 class="title">org tufte export</h1>
    <div id="table-of-contents">
      <h2>Table of Contents</h2>
      <div id="text-table-of-contents">
        <ul>
          <li>
            <a href="#org7097e81">1. ox-tufte</a>
            <ul>
              <li><a href="#org5c3075c">1.1. <span class=
              "done DONE">DONE</span> Add it to our
              packages.el</a></li>
              <li><a href="#org1473723">1.2. <span class=
              "done DONE">DONE</span> Add a use-package! in our
              config.org</a></li>
              <li><a href="#org385f199">1.3. <span class=
              "done DONE">DONE</span> Find where the code is
              written</a></li>
              <li><a href="#org6ea4d81">1.4. <span class=
              "done DONE">DONE</span> Add a def link function, with
              same body as margin notes function</a></li>
              <li><a href="#org9ef5230">1.5. <span class=
              "done DONE">DONE</span> extend org-export settings to
              work better with tufte style</a></li>
              <li><a href="#org16718dc">1.6. <span class=
              "todo STRT">STRT</span> Adjust def link function to
              add different class to def links</a></li>
              <li><a href="#orgd06b216">1.7. Create basic, nicely
              readable CSS for exports that utilize margin
              notes</a></li>
              <li><a href="#orga091cdb">1.8. extend CSS to bring in
              tooltip functionality like my dev zines</a></li>
              <li><a href="#org9b79f52">1.9. investigate how to
              parse different org file within a function</a></li>
              <li><a href="#org94b2f31">1.10. for definition, find
              its heading in different org file, then include its
              body.</a></li>
            </ul>
          </li>
        </ul>
      </div>
    </div>
    <p>Tufte CSS is a slighly overplayed sytle of making easy to
    parse HTML. Its main feature is having footnotes and margin
    notes throughout.</p>
    <p>I like these, and want to use the initial export to get the
    right html which we can then style a bit better using custom
    CSS.</p>
    <div id="outline-container-org7097e81" class="outline-2">
      <h2 id="org7097e81"><span class="section-number-2">1</span>
      ox-tufte</h2>
      <div class="outline-text-2" id="text-1">
        <p><a href=
        "https://github.com/dakrone/ox-tufte">https://github.com/dakrone/ox-tufte</a></p>
        <p>This is the package for our export, made by a Clojure
        legend incidentally!</p>
      </div>
      <div id="outline-container-org5c3075c" class="outline-3">
        <h3 id="org5c3075c"><span class=
        "section-number-3">1.1</span> <span class=
        "done DONE">DONE</span> Add it to our packages.el</h3>
      </div>
      <div id="outline-container-org1473723" class="outline-3">
        <h3 id="org1473723"><span class=
        "section-number-3">1.2</span> <span class=
        "done DONE">DONE</span> Add a use-package! in our
        config.org</h3>
      </div>
      <div id="outline-container-org385f199" class="outline-3">
        <h3 id="org385f199"><span class=
        "section-number-3">1.3</span> <span class=
        "done DONE">DONE</span> Find where the code is written</h3>
        <div class="outline-text-3" id="text-1-3"></div>
      </div>
      <div id="outline-container-org6ea4d81" class="outline-3">
        <h3 id="org6ea4d81"><span class=
        "section-number-3">1.4</span> <span class=
        "done DONE">DONE</span> Add a def link function, with same
        body as margin notes function</h3>
      </div>
      <div id="outline-container-org9ef5230" class="outline-3">
        <h3 id="org9ef5230"><span class=
        "section-number-3">1.5</span> <span class=
        "done DONE">DONE</span> extend org-export settings to work
        better with tufte style</h3>
        <div class="outline-text-3" id="text-1-5">
          <p>this will be just better in general, making a nice
          readable center column and such.</p>
        </div>
      </div>
      <div id="outline-container-org16718dc" class="outline-3">
        <h3 id="org16718dc"><span class=
        "section-number-3">1.6</span> <span class=
        "todo STRT">STRT</span> Adjust def link function to add
        different class to def links</h3>
        <div class="outline-text-3" id="text-1-6">
          <p>Am doing this by defining a new custom link for dfn,
          so you can add a definition liek so
          <code>[dfn:term][text]</code> Ideally, then, on export,
          we would grab the definition of the term from a stated
          glossary and put that into a tooltip on hover.</p>
          <p>This is my current scratch to do this, using custom
          org links and org-ql</p>
        </div>
      </div>
      <div id="outline-container-orgd06b216" class="outline-3">
        <h3 id="orgd06b216"><span class=
        "section-number-3">1.7</span> Create basic, nicely readable
        CSS for exports that utilize margin notes</h3>
      </div>
      <div id="outline-container-orga091cdb" class="outline-3">
        <h3 id="orga091cdb"><span class=
        "section-number-3">1.8</span> extend CSS to bring in
        tooltip functionality like my dev zines</h3>
      </div>
      <div id="outline-container-org9b79f52" class="outline-3">
        <h3 id="org9b79f52"><span class=
        "section-number-3">1.9</span> investigate how to parse
        different org file within a function</h3>
      </div>
      <div id="outline-container-org94b2f31" class="outline-3">
        <h3 id="org94b2f31"><span class=
        "section-number-3">1.10</span> for definition, find its
        heading in different org file, then include its body.</h3>
      </div>
    </div>
  </div>
  <div id="postamble" class="status">
    <p class="author">Author: ii friend</p>
    <p class="date">Created: 2021-02-19 Fri 10:59</p>
  </div>
</body>
</html>
